//------------------------------------------------------------------------------
// Riddle.cpp - содержит процедуры дл€ работы с загадками
//------------------------------------------------------------------------------

#define _CRT_SECURE_NO_WARNINGS
#include "Riddle.h"

//------------------------------------------------------------------------------
// ¬вод параметров загадки из потока
void In(Riddle& r, FILE* file) {
    fscanf(file, "%s", r.answer);
}

// —лучайный ввод параметров загадки
void InRnd(Riddle& r) {
    r.answer = GenerateContent(Random(10));
}



