//------------------------------------------------------------------------------
// Aphorism.cpp - содержит процедуры для работы с пословицами и поговорками
//------------------------------------------------------------------------------

#define _CRT_SECURE_NO_WARNINGS
#include "stdio.h"
#include "Saying.h"

//------------------------------------------------------------------------------
// Ввод параметров пословицы/поговорки из потока
void In(Saying& s, FILE* file) {
    fscanf(file, "%s", &s.country);
}

// Случайный ввод параметров пословицы/поговорки
void InRnd(Saying& s) {
    s.country = GenerateContent(Random(10));
}

//------------------------------------------------------------------------------
// Вывод параметров загадки в поток
void Out(Saying s, FILE* file) {
    fprintf(file, "It is Saying from . %s - %s. Quotient = %a", s.country, s.content, Quotient(s));
}

