//------------------------------------------------------------------------------
// Saying.cpp - содержит процедуры дл€ работы с пословицами и поговорками
//------------------------------------------------------------------------------

#define _CRT_SECURE_NO_WARNINGS
#include "Saying.h"

//------------------------------------------------------------------------------
// ¬вод параметров пословицы/поговорки из потока
void In(Saying& s, FILE* file) {
    fscanf(file, "%s", s.country);
}

// —лучайный ввод параметров пословицы/поговорки
void InRnd(Saying& s) {
    s.country = GenerateContent(Random(10));
}
